Tekla.Structures.Model.HierarchicObject
The HierarchicObject class defines an object in a tree-structured hierarchy. The hierarchy structure is defined
by hierarchical definitions which the hierarchical objects instantiate. Hierarchical objects may contain
other hierarchical objects, thus forming a sub-hierarchy, or model objects.
Tekla.Structures.Model.HierarchicDefinition
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
HierarchicDefinition scenarioDefinition = new HierarchicDefinition();
scenarioDefinition.Name = "Scenario type";
scenarioDefinition.HierarchyType = HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_SCENARIO;
scenarioDefinition.Insert();
HierarchicObject scenario = new HierarchicObject();
scenario.Name = "First scenario";
scenario.Definition = scenarioDefinition;
scenario.Insert();
}
}

Tekla.Structures.Model.HierarchicObject.MAX_HIERARCHIC_CHILDREN
Maximum number of hierarchical object resources.

Tekla.Structures.Model.HierarchicObject.Name
The name of the hierarchical object.

Tekla.Structures.Model.HierarchicObject.Definition
The hierarchical definition which the hierarchical object is associated with.

Tekla.Structures.Model.HierarchicObject.Father
The father of the hierarchical object.

Tekla.Structures.Model.HierarchicObject.HierarchicChildren
An array list that contains the hierarchical object's hierarchical children (of the type hierarchical object).

Tekla.Structures.Model.HierarchicObject.#ctor
Creates a new hierarchical object instance.

Tekla.Structures.Model.HierarchicObject.#ctor(Tekla.Structures.Identifier)
Instantiates a hierarchical object with a known identifier. The instantiation has to be done
before the hierarchical definition instance can be selected.
ID: The identifier of an existing hierarchical object.
using Tekla.Structures.Model;
using Tekla.Structures;
public class Example
{
public void Example1()
{
Identifier id = new Identifier(357);
HierarchicObject hierarchicalObject = new HierarchicObject(id);
}
}

Tekla.Structures.Model.HierarchicObject.Insert
Inserts the hierarchical object instance in the model.
Returns: True if the insertion was successful.

Tekla.Structures.Model.HierarchicObject.Select
Selects the hierarchical object instance from the model. The ID must be set.
Returns: True if the selection was successful.

Tekla.Structures.Model.HierarchicObject.Modify
Modifies the hierarchical object instance in the model. The ID must be set.
Returns: True if the modification was successful.

Tekla.Structures.Model.HierarchicObject.Delete
Deletes the hierarchical object instance from the model. The ID must be set.
Returns: True if the deletion was successful.

Tekla.Structures.Model.HierarchicObject.AddObjects(System.Collections.ArrayList)
Associates model objects with the hierarchical object.
Fails if the hierarchical definition doesn't exist in the model.
Objects: The model objects.
Returns: True if successful.

Tekla.Structures.Model.HierarchicObject.RemoveObjects(System.Collections.ArrayList)
Removes associations to the given list of model objects.
Fails if the hierarchical definition doesn't exist in the model.
Objects: The model objects.
Returns: True if successful.